[{"name":"DJI Osmo Pocket","description":"Lightweight and super powerful -DJI osmo pocket is the smallest 3-axis handheld camera. With a Gimbal Camera with 1/2.3\" CMOS Sensor, it can shoot 4K videos at 60fps. Easily connect to the smartphone via the Mimo App. So rent it today on Mutterfly and convert your moments into stunning memories.","price":4818,"title_tags":"Rent DJI Osmo Pocket at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/DJI-Osmo-Pocket.jpg","vendor":"GBR","category":"Party","slug":"dji-osmo-pocket"},{"name":"Canon EOS 1500D","description":"The new Canon EOS 1500D camera is equipped with a 24.1-megapixel APS-C-size CMOS sensor and an optical viewfinder for an authentic DSLR shooting experience. Capturing sharp images is easy thanks to the fast, accurate AF and the large grip that provides a firm, steady hold on the camera. Built-in Wi-Fi / NFC connectivity enables a seamless upload on social media and provides a user friendly experience.","price":5278,"title_tags":"Rent Canon EOS 1500D at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/1500D+banner+image.jpg","vendor":"GBR","category":"Party","slug":"canon-eos-1500d"},{"name":"Trekking Jacket","description":"Ideal for hikes in the snow: lined hood with good coverage, warm pockets and a large wadded flap behind the zip for an additional 3°C. Waterproof and comfortable down to -10°C.","price":5911,"title_tags":"Rent Trekking Jackets at low prices","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/jacket+product+image+-min.jpg","vendor":"AST","category":"Electronics","slug":"trekking-jacket"},{"name":"Trekking Headlamps","description":"If you are heading for trekking at night, a good trekking Headlamp will be your lifeline. Enter your dates and choose from a range of options on Mutterfly. The best combination and a must have with your trekking gear. ","price":508,"title_tags":"Rent Trekking HeadLamps at low prices","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Lamp%2BProduct%2Bimage-min.jpg","vendor":"AST","category":"Cameras","slug":"trekking-headlamps"},{"name":"Trekking Shoes","description":"Trekking enthusiasts will love these comfortable and lightweight trekking boots, designed to guarantee excellent foot motion. ","price":8864,"title_tags":"Rent Trekking Shoes at low prices","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Shoes%2Bwhats%2Bincluded-min.jpg","vendor":"GBR","category":"Electronics","slug":"trekking-shoes"},{"name":"Sony A7 III","description":"Capture the peaks of more decisive moments with the α7s III from Sony packing newly developed back-illuminated full-frame CMOS sensor and other advanced imaging innovations, high-speed response, ease of operation, and reliable durability that are ready for various shooting needs.","price":1595,"title_tags":"Rent Sony A7 III at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/Sony Prod image-min.jpg","vendor":"GBR","category":"Electronics","slug":"sony-a7-iii"},{"name":"Trekking Gloves","description":"Made for protecting your hands from the cold while hiking. Protect your hands this winter with these warm, thin and strong gloves. Recommended conditions of use: from 10 to 4°C","price":8655,"title_tags":"Rent Trekking Gloves at low prices","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Trekking+Gloves.jpg","vendor":"GBR","category":"Party","slug":"trekking-gloves"},{"name":"Nikon D5600","description":"The D5600 offers plenty of room to grow with exceptional image quality, intuitive controls and powerful tools for pushing the boundaries of your creativity as far as they’ll bend.","price":3436,"title_tags":"Rent Nikon D5600 at low prices","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Nikon+D5600+product+image-min.jpg","vendor":"AST","category":"Party","slug":"nikon-d5600"},{"name":"God Of War 4","description":"It is a new beginning for Kratos. Living as a man outside the shadow of the gods, he ventures into the brutal Norse wilds with his son Atreus, fighting to fulfil a deeply personal quest. So go ahead and rent God of War 4 on Mutterfly.\n","price":3062,"title_tags":"Rent God Of War 4 at low prices","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/god-of-war-4.jpg","vendor":"RPC","category":"Electronics","slug":"god-of-war-4"},{"name":"Spiderman","description":"Swing into action with this Marvel Spider-Man game. This Insomniac offering lets you take crime fighting to all of Manhattan via third-person action, including plenty of iconic web-slinging, parkour moves and combat opportunities. A brand new storyline satisfies hardcore fans and newcomers in this Marvel Spider-Man game so go ahead and rent Spiderman on Mutterfly\n","price":6649,"title_tags":"Rent Spiderman PS4 at low prices","image":"https://s3-us-west-2.amazonaws.com/elasticbeanstalk-us-west-2-492482793628/flamingo/products/Spiderman+Prod.+Image-min.jpg","vendor":"RPC","category":"Party","slug":"spiderman"},{"name":"Far Cry 5","description":"Freely explore Hope County’s rivers, lands and skies with the largest customizable weapon and vehicle roster ever in a Far Cry game. You are the hero of the story in a thrilling world that hits back with every punch and where the places you discover and the locals you ally with will shape your story in ways you’ll never see coming, so go ahead and rent Far Cry 5 on Mutterfly\n","price":8353,"title_tags":"Rent Far Cry 5 PS4 at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/Far cry 5 Prod. image-min.jpg","vendor":"AST","category":"Electronics","slug":"far-cry-5"},{"name":"Red Dead Redemption 2","description":"From the creators of Grand Theft Auto V and Red Dead Redemption, Red Dead Redemption 2 is an epic tale of life in America at the dawn of the modern age where the end of the wild west era has begun as lawmen hunt down the last remaining outlaw gangs. Those who will not surrender or succumb are killed. Go ahead and rent Red Dead Redemption 2 on Mutterfly\n","price":9402,"title_tags":"Rent Red Dead Redemption 2 at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/RDR 2 Prod. Image-min.jpg","vendor":"AST","category":"Party","slug":"red-dead-redemption-2"},{"name":"Metro Exodus","description":"Travel over the post-apocalyptic Russian tundra and lead a band of Spartan Rangers to freedom in Metro Exodus. Set 25 years after a devastating nuclear war, this game follows the exploits of lead character Artyom in a believable adventure made specifically for PS4. A sequel to Deep Silver's Metro: Last Light, Metro Exodus delivers stunning graphics and a compelling storyline so go ahead and rent Metro Exodus on Mutterfly.","price":4266,"title_tags":"Rent Metro Exodus PS4 at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/Merto Prod. Image-min.jpg","vendor":"GBR","category":"Cameras","slug":"metro-exodus"},{"name":"Resident Evil 2","description":"Resident Evil 2 offers a fresh take on the classic survival horror saga with breathtakingly realistic visuals, heart-poundingly immersive audio, a new over-the-shoulder camera, and modernized controls on top of gameplay modes from the original game. So go ahead and rent Resident Evil 2 on Mutterfly","price":5562,"title_tags":"Rent Resident Evil 2 PS4 at low prices","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/resident-evil-2.jpg","vendor":"RPC","category":"Party","slug":"resident-evil-2"},{"name":"Injustice 2","description":"Take on your favourite DC villains when you play Injustice 2. This massive fighting game offers a wide range of characters to choose from. Featuring compelling storytelling and dynamic graphics, Injustice 2 puts you in the middle of the action. So go ahead and rent Injustice 2 on Mutterfly\n","price":9141,"title_tags":"Rent Injustice 2 PS4 at low prices","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/injustice-2-prod.jpg","vendor":"RPC","category":"Electronics","slug":"injustice-2"},{"name":"Devil May Cry 5","description":"The Devil you know returns in this brand-new entry in the over-the-top action series. Prepare to get downright demonic with this signature blend of high-octane stylized action and otherworldly and original characters the series is known for. The director Hideaki Itsuno and the core team have returned to create an insane, technically advanced action experience. So go ahead and rent DMC 5 on Mutterfly\n","price":9459,"title_tags":"Rent Devil May Cry 5 PS4 at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/DMC Prod. Image-min.jpg","vendor":"GBR","category":"Cameras","slug":"devil-may-cry-5"},{"name":"Xbox One Controller","description":"This includes 1 Xbox One controller compatible with Xbox One gaming console.","price":9420,"title_tags":"Rent Xbox One Controller 4 at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/Artboard 2-min.jpg","vendor":"GBR","category":"Party","slug":"xbox-one-controller"},{"name":"FIFA 19","description":"FIFA 19 delivers a champion's calibre-experience on and off the pitch. Led by the prestigious UEFA Champions League, FIFA 19 offers enhanced gameplay tools that allow you to control the pitch in every moment with unrivalled ways to play. Rent FIFA 19 on Mutterfly now!","price":1626,"title_tags":"Rent FIFA 19 at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/FIFA 19 prod. image-min.jpg","vendor":"RPC","category":"Party","slug":"fifa-19"},{"name":"Gaming Computer","description":"Step into the world of gaming without breaking the bank. This unit meets the required specifications for most games on the market and is a great starting point for any gamer. The specifications for the gaming PC is: Processor i5 8400 with gigabyte z370, GPU Zotac 1060 amp edition, Ram 8 GB DDR4, WD 1TB HDD.","price":608,"title_tags":"Rent Gaming PC at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/Artboard 50-min.jpg","vendor":"AST","category":"Party","slug":"gaming-computer"},{"name":"Tamron A035E 100-400mm F/4.5-6.3 Di VC USD Lens ","description":"The new Tamron 100-400mm F4.5-6.3 Di VC USD is a lightweight telezoom aimed at enthusiast full-frame and APS-C DSLR users. ","price":7113,"title_tags":"Rent Canon 100-400mm lens at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/Artboard 15.jpg","vendor":"AST","category":"Cameras","slug":"tamron-a035e-100-400mm-f/4.5-6.3-di-vc-usd-lens"},{"name":"Inflatable Swimming Pool","description":"Being afraid of building a swimming pool in your backyard cost a fortune? Here’s another solution, rent an inflatable swimming pool for your family from Mutterfly. The inflatable swimming pool is real fun and convenient. So make a splash this summer with an inflatable pool. Please note: the product is available for a duration of 4 to 5 hours and water is not included with the product. ","price":9906,"title_tags":"Rent Inflatable Swimming Pool at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/Artboard 75-min (1).jpg","vendor":"RPC","category":"Party","slug":"inflatable-swimming-pool"},{"name":"Aqua Zorb with a Swimming pool","description":"Throw an awesome pool party with Aqua Zorbing Roller. Inflatable pool with Zorb Roller is a guaranteed attraction for any event. It is super fun and a perfect product to beat the summer heat. Please note the product is only available for the duration of 4 to 5 hours and water is not included with the pool. ","price":8601,"title_tags":"Rent Aqua Zorbing Roller at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/Artboard 67-min.jpg","vendor":"GBR","category":"Electronics","slug":"aqua-zorb-with-a-swimming-pool"},{"name":"Feed the Clown Game","description":"Feed the Clown game is a hilarious variation on the ball in a bucket game. Simply try throwing the 3 balls through the mouth of the clown to win a prize. Works perfectly as a traditional side stall game at a fayre, fete, corporate fun day or any other event or occasion.","price":9540,"title_tags":"Rent Feed the Clown Game at low prices","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/ftc-prod.jpg","vendor":"AST","category":"Party","slug":"feed-the-clown-game"},{"name":"Party Soundbar ","description":"The LG soundbar with the bass speaker is the perfect choice for any house party. The speakers can be paired with Bluetooth or can be connected with the Aux cable.","price":2531,"title_tags":"Rent Party Soundbar at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/Soundbar prod. pic-min.jpg","vendor":"AST","category":"Party","slug":"party-soundbar"},{"name":"Mortal Kombat 11","description":"Continue the epic saga and through a new cinematic story that is more than 25 years in the making. Players will take on the role of a variety of past and present characters in a time-bending new narrative. One of the best multiplayer games of 2019, only on Mutterfly.","price":4109,"title_tags":"Rent Mortal Kombat 11 at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/MK 11 prod. image-min.jpg","vendor":"AST","category":"Cameras","slug":"mortal-kombat-11"},{"name":"Canon EOS 1DX Mark II","description":"\"The EOS-1D X Mark II is Canon’s newest flagship DSLR aimed at pro-level photographers. The latest addition to the1D-series camera, the 1DX II sports a lot of new features, including a brand new 20MP full-frame sensor, a pair of faster DIGIC 6+ image processors, a quicker 14fps continuous burst rate. 1DX Mark II is brimming with the high-performance features that professional photojournalists, sports and wildlife photographers, as well as advanced enthusiasts, demand.\n\nCapture stunning images and high definition videos. Rent the Canon 1DX Mark II on Mutterfly\"","price":6087,"title_tags":"Rent Canon EOS 1DX Mark II at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/1D Prod. image-min.jpg","vendor":"AST","category":"Electronics","slug":"canon-eos-1dx-mark-ii"},{"name":"Canon EOS R","description":"The EOS R is Canon's first full-frame mirrorless camera. It's built around 30-megapixel Dual Pixel CMOS sensor. Canon EOS R is an amazing contender when it comes to professional low light photography. Suitable for wedding photography and ideal for photography in artificial lighting.   \n\nRent Canon R series on Mutterfly. ","price":6276,"title_tags":"Rent Canon EOS R in Mumbai","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/EOS R prod. image-min.jpg","vendor":"AST","category":"Cameras","slug":"canon-eos-r"},{"name":"Canon 24-70mm F2.8 lens","description":"EF 24-70mm f/2.8L II USM is the latest update to the acclaimed L-Series of EF optics, re-establishing a new standard for superb optics, high-end durable construction and performance in professional zoom lenses. A standard focal length zoom lens, it also features a large aperture throughout its focal length.\n\nRent Canon 24-70mm on Mutterfly and get it delivered to your doorstep. Let's click.","price":9524,"title_tags":"Rent Canon 24-70mm F2.8 lens at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/24-70mm canon lens-min.jpg","vendor":"GBR","category":"Electronics","slug":"canon-24-70mm-f2.8-lens"},{"name":"Canon 35mm Lens","description":"The 35mm Canon lens is an extremely popular lens for portraits. It is a go-to focal length for photojournalists, wedding and event photographers, portrait photographers. \n\nRent Canon 35mm lens on Mutterfly and capture amazing images.","price":9652,"title_tags":"Rent Canon 35mm Lens at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/Canon 35mm lens -min.jpg","vendor":"GBR","category":"Party","slug":"canon-35mm-lens"},{"name":"Canon 8-15mm fish eye lens","description":"Canon EF 8-15mm Fisheye lens delivers crisp images, focuses quickly, and is built to withstand the rigours of real-world photography. It is a unique lens which can click full frame circular photographs. A must-have for wildlife photographers. \nCapture stunning images and high definition videos. Rent the Canon Canon 8-15mm Fisheye lens on Mutterfly","price":3442,"title_tags":"Rent Canon 8-15mm fish eye lens at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/8-15 Fisheye-min.jpg","vendor":"RPC","category":"Electronics","slug":"canon-8-15mm-fish-eye-lens"},{"name":"Canon 85mm F1.8 lens","description":"Canon EF 85mm Lens is designed to produce beautiful background blur. The natural angle of view and perspective is ideal for portraits and natural images. popular among professional photographers. Its fast f/1.8 aperture is perfect for controlling shallow depth of field focus.  \nRent Canon 85mm lens on Mutterfly and capture amazing images.","price":7886,"title_tags":"Rent Canon 85mm F1.8 lens at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/85mm lens canon-min.jpg","vendor":"AST","category":"Party","slug":"canon-85mm-f1.8-lens"},{"name":"Sigma 85mm f/1.4 for canon","description":"The Sigma 85mm lens is the latest addition to the world-renowned Sigma Global Vision line. Designed and engineered for unparalleled image quality, designed and engineered for unparalleled image quality, the Sigma 85mm employs a completely new optical design and premium components. It is an ideal lens for a variety of photographic subjects, particularly portrait photography, both in-studio and on-location. Rent Canon 85mm lens on Mutterfly and capture amazing images.","price":4523,"title_tags":"Rent Sigma 85mm f1.4 for canon at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/Sigma 85mm for Canon-min.jpg","vendor":"AST","category":"Party","slug":"sigma-85mm-f/1.4-for-canon"},{"name":"Sigma 85mm f/1.4 for Nikon","description":"The Sigma 85mm lens is the latest addition to the world-renowned Sigma Global Vision line. Designed and engineered for unparalleled image quality, designed and engineered for unparalleled image quality, the Sigma 85mm 1.4 employs a completely new optical design and premium components. It is an ideal lens for a variety of photographic subjects, particularly portrait photography, both in-studio and on-location. Rent Canon 85mm lens on Mutterfly and capture amazing images.","price":8112,"title_tags":"Rent Sigma 85mm f/1.4 for Nikon at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/Sigma nikon -min.jpg","vendor":"AST","category":"Party","slug":"sigma-85mm-f/1.4-for-nikon"},{"name":"Nikon Z-7","description":"Z7 is Nikon's high-resolution mirrorless offering, it features a back-illuminated 45.7MP full-frame sensor with a native ISO range running from ISO 64 to 25,600. The Nikon Z7 also features an extended ISO range running from 32-102,400. To help you capture sharp images under a range of shooting scenarios, the Nikon Z7 features a built-in five-axis image stabilization system that offers up to five stops of compensation. It is one of the best in the class camera for low light photography. Rent Nikon Z series on Mutterfly and capture stunning low light images. ","price":5273,"title_tags":"Rent Nikon Z-7 at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/Nikon Z7-min.jpg","vendor":"AST","category":"Party","slug":"nikon-z-7"},{"name":"Nikon 24-70mm Lens","description":"Praised for its image quality and reliability, Nikon 24-70mm Lens is a favourite amongst the passionate people who take immense pleasure in photography. Its enhanced optical formula produces exceptional colour, contrast, sharpness and renders outstanding images and videos. The AF-S Nikon lens with a focal length of 24-70mm delivers fast and wide to medium angled zoom capability. Rent Nikon 24-70mm lens on Mutterfly and capture amazing images.","price":4879,"title_tags":"Rent Nikon 24-70mm Lens at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/24-70mm Nikon-min.jpg","vendor":"RPC","category":"Cameras","slug":"nikon-24-70mm-lens"},{"name":"Nikon 14-24mm Lens","description":"the Nikon 14-24mm Lens has been known for its remarkable edge-to-edge performance, superb colours and excellent contrast across its zoom range. the ideal lens for many kinds of photography including landscape and architecture photography. The 14-24mm features Nikon’s Silent Wave Motor (SWM) that delivers fast, smooth, silent and accurate autofocus operation, and it has a rugged construction to withstand heavy use in the field under any conditions. Rent Nikon 14-24mm lens on Mutterfly and capture amazing images.","price":7610,"title_tags":"Rent Nikon 14-24mm Lens at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/14-24mm lens -min.jpg","vendor":"GBR","category":"Electronics","slug":"nikon-14-24mm-lens"},{"name":"Studio light (fx-400)","description":"The FRX range combines creativity and performance The FRX compact flash units are a further evolution of the features and quality that are Elinchrom. The concept is simple: control, power, speed and versatility. Rent FRX series on Mutterfly now!","price":4745,"title_tags":"Rent Studio light (fx-400) at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/Studio light -min.jpg","vendor":"AST","category":"Electronics","slug":"studio-light-(fx-400)"},{"name":"Nikon 200-500mm lens","description":"Capture the power and beauty of wildlife, birds, travel destinations, and exciting sports action close-ups with this high-performance 200-500mm long-range zoom. This lens enables you to shoot crisp images of fast-moving, distant subjects handheld. A must-have for wildlife photography. Rent Nikon 200-500mm lens on Mutterfly and get it delivered to your doorstep. Let's click. ","price":2178,"title_tags":"Rent Nikon 200-500mm lens at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/200-500 nikon prod. image-min.jpg","vendor":"AST","category":"Cameras","slug":"nikon-200-500mm-lens"},{"name":"Nikon 80-200 ed f/2.8 Lens","description":"If you are interested in versatile photography, then check out this, Nikon AF Zoom-Nikkor 80-200mm F/2.8D ED Telephoto Zoom Lens. Among other lens of the Nikon, this lens has equipped for capturing different types of images with equal excellence. Be it wildlife or sports photography, it ensures a touch of perfection in each segment. Rent Nikon 80-200mm lens on Mutterfly and get it delivered to your doorstep. Let's click. ","price":6836,"title_tags":"Rent Nikon 80 -200 ed f/2.8 Lens at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/80-200 body-min.jpg","vendor":"GBR","category":"Electronics","slug":"nikon-80-200-ed-f/2.8-lens"},{"name":"Canon EOS M50","description":"Capture beautiful night time shots with mirrorless Canon EOS M50. It is a compact camera which packs a punch and is a great alternative for anyone who's looking to capture images in low light. Its body is small and compact which makes it ideal for bloggers and influencers. Rent Canon EOS M50 on Mutterfly now and click amazing shots. ","price":3210,"title_tags":"Rent Canon EOS M50 at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/M50 Prod.-min.jpg","vendor":"GBR","category":"Party","slug":"canon-eos-m50"},{"name":"DJI Osmo Action","description":"Creative Shooting Modes Diverse shooting functions enable you to perfectly capture on-the-fly moments. 8x Slow Motion Capture every epic move with jaw-dropping clarity and detail when you use 8x slow motion with 1080p resolution and 240fps. Timelapse Condense time and movement for stunning, easy-to-achieve results. Timed Shooting Mode Set up timed RAW shots, perfect for post-processing and additional control. Rent DJI Osmo Action on Mutterfly and witness the best of the sports camera!","price":5595,"title_tags":"Rent DJI Osmo Action for low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/osmo_action_product-min.jpg","vendor":"RPC","category":"Party","slug":"dji-osmo-action"},{"name":"LG OJ98 1800 W Bluetooth Party Speaker","description":"Looking for some great speakers foryour next house party? Go ahead and book a LG O98 1800 W Party speaker. Life's Good when the music is right.","price":1488,"title_tags":"LG OJ98 1800 W Bluetooth Party Speaker","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/LG Product-min.jpg","vendor":"GBR","category":"Cameras","slug":"lg-oj98-1800-w-bluetooth-party-speaker"},{"name":"Canon EOS 77D","description":"Boasting of the world's fastest-focusing AF focusing speed of 0.03sec. During Live View shooting, an attractive variety of functions and high operability, Canon EOS 77D DSLR will take your photos to the next level. Rent Canon EOS 77D on Mutterfly now!","price":1168,"title_tags":"Rent Canon EOS 77D at low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/77D-min.jpg","vendor":"AST","category":"Electronics","slug":"canon-eos-77d"},{"name":"Product Box Set","description":"A must-have for product photography. Place your products in this Product Box to create an amazing portfolio of your products. This professional Product Box Set comes with two 8' LED lights and stands. Rent out the Product Box from Mutterfly now and create an amazing portfolio of your products!","price":2561,"title_tags":"Rent Product Box Set for low prices","image":"https://elasticbeanstalk-us-west-2-492482793628.s3.amazonaws.com/flamingo/products/Soft box prod. pic-min.jpg","vendor":"AST","category":"Electronics","slug":"product-box-set"},{"name":"Playstation 4","description":"Get your hands on the PS4 with latest games starting at Rs 650. Rent on Mutterfly and get it delivered to your doorstep.","price":3119,"title_tags":"Rent PS4 with latest games in Mumbai | Bangalore","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Playstation_4.jpg","vendor":"RPC","category":"Electronics","slug":"playstation-4"},{"name":"Canon EOS 700D","description":"Canon EOS 700D is one of the best entry level DSLR Camera. High picture quality, live AF and creative filters provide for amazing pictures and a great Photography experience. Best for Birthday parties, events, photoshoots, video shoots etc.","price":5164,"title_tags":"Rent Canon EOS 700D at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Canon_700D.jpg","vendor":"GBR","category":"Cameras","slug":"canon-eos-700d"},{"name":"GoPro Hero5","description":"The hottest action camera, GoPro 5 is the perfect companion to capture high definition pictures and videos. Super lightweight and waterproof it is the perfect sports and adventure camera.","price":7081,"title_tags":"Rent GoPro Hero5 at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/GoPro_Hero5.jpg","vendor":"GBR","category":"Cameras","slug":"gopro-hero5"},{"name":"Hoverboard","description":"One of the coolest ways to move around, you are sure to love the Hoverboard. Get your balance and ride as fast as 20kmph. Rent from a variety of options on Mutterfly\n\nNote: Hoverboard works on the simple principle of balance. So it's going to require some amount of practise before you get comfortable. We suggest you put on the safety gear provided to ensure safety. Mutterfly will not assume responsibility for any accident/injury caused.","price":7698,"title_tags":"Rent Hoverboard at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/hoverboard.jpg","vendor":"GBR","category":"Party","slug":"hoverboard"},{"name":"Foosball Table","description":"Football fan or not, a Foosball table is the perfect entertainer for all groups. Rent it on Mutterfly and let the games begin. Best for college events, corporate events, team events, house parties etc.","price":1055,"title_tags":"Rent Foosball Table at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Foosball_Table.jpg","vendor":"RPC","category":"Cameras","slug":"foosball-table"},{"name":"Canon 5D Mark III","description":"The Canon EOS 5D Mark III is the world's best high end professional DSLR. It is ideal for shooting weddings in the studio or out in the field, and great for still photography. Advanced professional-level HD video capabilities make it possible to capture beautiful cinematic movies in EOS HD quality.","price":8025,"title_tags":"Rent Canon 5D Mark III at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Canon_5D_MarkIII.jpg","vendor":"AST","category":"Electronics","slug":"canon-5d-mark-iii"},{"name":"Giant Jenga","description":"When it comes to board games, Size does matter! The Giant Jenga has 54 solid wood blocks made of timber. The game stands 2.5 feet tall to start and depending on your level of experience can reach a height of 5 feet! The Jenga blocks come in a compact carry case and easily fits in the trunk of your car. Rent the Giant Jenga and make your birthday parties, corporate events, camping and group events filled with smiles and laughter.\n\n(Don't forget to record the Giant Jenga falling down - makes a great Instagram video).","price":3059,"title_tags":"Rent Giant Jenga at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/GiantJenga.jpg","vendor":"AST","category":"Electronics","slug":"giant-jenga"},{"name":"Beer Pong Table","description":"Want to throw an epic house party? Rent a Beer Pong table and get set for an evening of fun, laughter and lots of beer.","price":2383,"title_tags":"Rent Beer Pong Table at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Beer_Pong_Table.jpg","vendor":"AST","category":"Electronics","slug":"beer-pong-table"},{"name":"2 Man Tent","description":"Sometimes all you need is a clear sky and a tent underneath. Have the best camping nights. For all the little and great adventures. Select your dates and rent a cosy tent on Mutterfly. ","price":5474,"title_tags":"Rent Tent at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/2_Man_Tent.jpg","vendor":"RPC","category":"Party","slug":"2-man-tent"},{"name":"Segway","description":"One of the best ways to see your city and beat the traffic. Experience the future of personal mobility today. The Segway can be used for a maximum of 8 hours when rented for 1 day.\n\nNote: Segway works on the simple principle of balance. So it's going to require some amount of practise before you get comfortable. We suggest you put on the safety gear provided to ensure safety. Mutterfly will not assume responsibility for any accident/injury caused.","price":7899,"title_tags":"Rent Segway at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Segway.jpg","vendor":"GBR","category":"Party","slug":"segway"},{"name":"Karaoke Set","description":"Looking for a fun evening with friends or family. Rent a Karaoke set and get set for a musical evening. From Adele to Arijit Singh, bring out your hidden talent and make everyone go Gaga!","price":6792,"title_tags":"Rent Karaoke set at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/KaraokeSet.jpg","vendor":"RPC","category":"Party","slug":"karaoke-set"},{"name":"Canon EOS 80D","description":"The Canon EOS 80D has enhanced functions for great shooting and image sharing with smart devices is also made simple as the camera supports Wi-Fi and NFC.","price":6566,"title_tags":"Rent Canon EOS 80D at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Canon_80D.jpg","vendor":"AST","category":"Cameras","slug":"canon-eos-80d"},{"name":"Disco Lights","description":"Convert your room into a nightclub. Enter your dates and browse through some powerful disco lights which are super easy to setup. Ideal for house parties, kids birthday parties etc.","price":2461,"title_tags":"Rent Disco Lights at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Disco_Lights.jpg","vendor":"GBR","category":"Cameras","slug":"disco-lights"},{"name":"Nikon D5300","description":"The Nikon D5300 is an ultra-high-resolution DSLR with built-in Wi-Fi for photo sharing to your smartphone or tablet, GPS and mapping. The best of its kind in the Nikon range. Great for video and still photography.","price":4332,"title_tags":"Rent Nikon D5300 at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/NikonD5300.jpg","vendor":"AST","category":"Electronics","slug":"nikon-d5300"},{"name":"GoPro Hero6 Black","description":"The latest addition to the GoPro family. The GoPro Hero 6 Black records videos in 4K Ultra HD. Super lightweight and waterproof it is the perfect sports and adventure camera. Capture your best adventures like snorkelling, cliff diving, deep sea diving, bungee jumping, trekking etc.","price":8886,"title_tags":"Rent GoPro 6 at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/GoPro-Hero-6-front-case.jpg","vendor":"AST","category":"Party","slug":"gopro-hero6-black"},{"name":"Air Hockey Table","description":"Get ready for hours of heart-pounding, fast paced fun! \nRent an Air Hockey Table and fill excitement in your party - arcade style. \nIdeal for birthdays, events and house parties","price":9164,"title_tags":"Rent Air Hockey Table at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/AirHockey.jpg","vendor":"GBR","category":"Electronics","slug":"air-hockey-table"},{"name":"Snap Polaroid Camera","description":"Fuel your nostalgia. For the love of old school and instant films get your hands on the ever classic Polaroid cameras!\njust click and hold the picture in your hand in no time! Get the best memories captured for your birthdays, reunions, bachelorette, corporate events, etc. ","price":4994,"title_tags":"Rent Polaroid Camera at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Polaroid_1.jpg","vendor":"AST","category":"Electronics","slug":"snap-polaroid-camera"},{"name":"13 inch Macbook Pro","description":"Macbook Pro with Core i5 Processor available in 13 inch screen. One of the widely used and best performing laptops. Ideal for freelancers, corporates, individuals, etc. Great for designing and editing work.","price":1534,"title_tags":"Rent Macbook Pro at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Macbook_Pro.jpg","vendor":"RPC","category":"Electronics","slug":"13-inch-macbook-pro"},{"name":"Canon EOS 1300D","description":"The EOS 1300D has amazing auto shooting features allowing you to take beautiful photos like a pro. Wi-Fi and NFC compatibility allows easy file transfer to other devices. \nAll the more convenient for sharing those wonderful photos on social media!","price":6098,"title_tags":"Rent Canon EOS 1300D at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Canon1300D.jpg","vendor":"GBR","category":"Electronics","slug":"canon-eos-1300d"},{"name":"Trekking Backpack-50 L","description":"If you are heading for the outdoors, a good trekking backpack will be your lifeline. Enter your dates and choose from a range of options on Mutterfly. The best combination and a must have with your trekking gear. Climb the highest mountains with your trekking backpack.","price":5776,"title_tags":"Rent Trekking Backpack at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Trekking_Backpack.jpg","vendor":"GBR","category":"Party","slug":"trekking-backpack-50-l"},{"name":"40 inch TV","description":"LED flatcreen 40 inch TV with amazing visual and sound outputs, great for gaming events, movie screenings, sports match screenings etc. TVs provided would be Micromax /Viu/ Panasonic.","price":9819,"title_tags":"Rent TV at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/42_Inches_LED_TV.jpg","vendor":"RPC","category":"Cameras","slug":"40-inch-tv"},{"name":"Smoke Machine","description":"Wherever there is smoke, there is a good smoke Machine! Select your dates and rent a smoke machine on Mutterfly. Add the oomph to your party! Best for Birthday parties, house parties, stage events, etc","price":4858,"title_tags":"Rent Smoke Machine at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/SmokeMachine1.jpg","vendor":"AST","category":"Party","slug":"smoke-machine"},{"name":"Sony A6000","description":"The Sony A6000 is top of the line mirrorless Camera. It si compact and small in size. Great to use while travelling with amazing quality. It is one of the highly used cameras by bloggers. Great for shooting in those portrait shots and videos.! ","price":4128,"title_tags":"Rent Sony A6000 at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/SonyA6300.jpg","vendor":"GBR","category":"Electronics","slug":"sony-a6000"},{"name":"Zoom H6n Portable Recorder","description":"An upgrade to the existing set of recorder with the H6 six-track recorder, the bar is raised further. Whatever your application live recording, professional film/video work, live broadcast or electronic news gathering the H6 can handle it with ease.","price":2756,"title_tags":"Rent Zoom H6n Portable Recorder at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/ZoomH6n.png","vendor":"GBR","category":"Party","slug":"zoom-h6n-portable-recorder"},{"name":"Projector","description":"Watch your favorite movies, cricket and football matches on big screen right at the comfort of your house with the Projectors and Screens. Great for gatherings, sports match night, ideal for date night, birthday parties, house parties, etc.","price":6574,"title_tags":"Rent Projector at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Projector.png","vendor":"RPC","category":"Cameras","slug":"projector"},{"name":"Bubble Machine","description":"One of the most favourite item amongst both kids and adults. Add a charm to your party with the iridescent bubbles. Best used for birthday parties, events, flea markets, stage events, wedding events, etc.","price":2646,"title_tags":"Rent Bubble Machine at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/BubbleMachine.jpg","vendor":"GBR","category":"Party","slug":"bubble-machine"},{"name":"Canon 5D Mark IV","description":"The 4th generation model of Canon best-selling full-frame EOS camera Canon 5D Mark IV is the latest addition and a worthy upgrade to the Mark III. It has a higher-resolution sensor with Dual Pixel autofocus, 4K video capture, an upgraded AF system, a touchscreen, built-in Wi-Fi/NFC and GPS. ","price":8927,"title_tags":"Rent Canon 5D Mark IV at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Canon_5D_MarkIV.jpg","vendor":"GBR","category":"Cameras","slug":"canon-5d-mark-iv"},{"name":"Xbox One","description":"The Xbox one is a gamer's heaven that offers rich display and seamless gaming experience. Great for a gamin night with friends at home. Ideal for a boys night, college fests, corporate events, gaming events, etc.","price":5971,"title_tags":"Rent Xbox One at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Xbox_one.jpg","vendor":"AST","category":"Party","slug":"xbox-one"},{"name":"VR Set","description":"Experience the world in a whole new manner with the Virtual Reality headsets by just connecting your Smartphones. VR headsets are widely used for Video Gaming, Films, and entertainment.","price":9605,"title_tags":"Rent VR Set at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/VRSet.png","vendor":"AST","category":"Party","slug":"vr-set"},{"name":"Nikon 50mm (f/1.8G) Prime Lens","description":"A must-have for standard portraits and everyday use, the Nikon 50mm is a lens that will absolutely surprise you. Offering natural image rendering and exceptional sharpness, it is a versatile, affordable prime lens.","price":9748,"title_tags":"Rent Nikon Lenses at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Nikon50mm.jpg","vendor":"AST","category":"Electronics","slug":"nikon-50mm-(f/1.8g)-prime-lens"},{"name":"Collar Mic","description":"The tiny clip on Mics are the best for any shoots, interviews etc. Compatible with all the latest cameras and recorders. Available in Sennheiser.","price":1329,"title_tags":"Rent Collar Mic at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Collar_Mic.jpg","vendor":"GBR","category":"Party","slug":"collar-mic"},{"name":"iMac","description":"Apple's iMac is an ultra-thin all-in-one desktop computer, available in 21.5 and 27 inch sizes with an array of build-to-order upgrades.\nHighly used desktop for designing, video editing and other purposes.","price":784,"title_tags":"Rent iMac at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/iMac.jpg","vendor":"AST","category":"Electronics","slug":"imac"},{"name":"DJI Osmo","description":"Bumpy ride no more! Thanks to advanced technologies specifically designed to keep the camera flat no matter how you move it, the DJI Osmo helps you shoot 4K UHD videos. Get high quality stabilized shots with the Osmo.","price":3774,"title_tags":"Rent DJI Osmo at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/DJIOsmo.jpg","vendor":"AST","category":"Party","slug":"dji-osmo"},{"name":"Canon Lens EF 16-35 mm f 2.8","description":"The Canon EF 16 -35 mm is a high performance, water-resistant, and ultra wide-angle Canon L-series lens. It has been specifically designed for improved edge-to-edge image quality that will meet the strict requirements of professional and high-end amateur photographers.","price":2069,"title_tags":"Rent Canon Lens  EF 16 - 35 mm f  2.8 at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/CanonLens_EF16_35mm%20f2.8LII.jpg","vendor":"GBR","category":"Party","slug":"canon-lens-ef-16-35-mm-f-2.8"},{"name":"Canon EF 100mm f/2.8 Macro USM","description":"The Canon EF 100mm f/2.8 Macro USM is a great lend for Macro photography. Capture super sharp images. Ideal for nature shots, stills and portraits.","price":4318,"title_tags":"Rent Canon EF 100mm f/2.8 Macro USM at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Canon100mm.jpg","vendor":"GBR","category":"Party","slug":"canon-ef-100mm-f/2.8-macro-usm"},{"name":"Giant Chess","description":"An absolute favourite for house parties and outdoor events, the humble Chess board gets a lifesize makeover. Pick a side and get ready for an engaging game of Chess. Book your Giant Chess board on Mutterfly. Best for kids birthday parties, corporate events, get-togethers.\nChessboard Mat Size - 4ftx3ft \nChess Pegs - 32","price":8598,"title_tags":"Rent Giant Chess Board - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Giant_Chess.jpg","vendor":"RPC","category":"Party","slug":"giant-chess"},{"name":"Tug Of War Rope","description":"One of the most ancient and fun games known to man, the Tug of War is a game of strength and strategy. Played by a maximum of 8 people on each side, Tug of War is one of the best team games. Gather your mates and show them who is Hercules! Book your Tug of War ropes on Mutterfly today.","price":5542,"title_tags":"Rent Tug of War Ropes at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Tug_Of_War_Ropes.jpg","vendor":"AST","category":"Cameras","slug":"tug-of-war-rope"},{"name":"Giant Inflatable Get Knotted","description":"Get ready to get knotty!\nThis fun game challenges you to put your hands and feet at different points on the mat, without falling over the other player.\n\nBest suited for house parties and outdoor events.","price":6271,"title_tags":"Rent Giant Inflatable Get Knotted at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Giant_Inflatable_Get_Knotted.jpg","vendor":"RPC","category":"Electronics","slug":"giant-inflatable-get-knotted"},{"name":"Ladder Ball Set","description":"Have hours of fun and enjoyment tossing balls on the ladder of your team colour. \n\nDesigned for indoor and outdoor play, ideal for parties and team events.","price":664,"title_tags":"Rent Ladder Ball Set at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Ladder_Ball_Set.jpg","vendor":"RPC","category":"Cameras","slug":"ladder-ball-set"},{"name":"Trampoline","description":"Get ready for hours of active bouncing fun. Rent a trampoline to exemplify the fun for your kids and make it a special day for them filled with excitement and energy!.\nGreat for birthdays and outdoor events.\nFor Kids age group 5-15 yrs","price":3306,"title_tags":"Rent Trampoline | Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Trampoline.jpg","vendor":"GBR","category":"Party","slug":"trampoline"},{"name":"Nikon D5200","description":"Nikon D5200 is a great advanced beginner's camera. It sits between the range of Nikon D3200 and Nikon D7100. It allows to record videos in full HD 1080p. A delight for photography enthusiasts.","price":7332,"title_tags":"Rent Nikon D5200 at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Nikon_D5200.jpg","vendor":"RPC","category":"Cameras","slug":"nikon-d5200"},{"name":"50mm Canon Lens","description":"Compact and lightweight, an outstanding walk-around lens - Canon's EF 50mm f/1.8 STM is a great entry into the world of EOS prime lenses. \nIt's an excellent prime lens for portraits, action, even nighttime photography and video shots.","price":1074,"title_tags":"Rent 50mm Canon Lens at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/50mmMacrolens.jpg","vendor":"GBR","category":"Electronics","slug":"50mm-canon-lens"},{"name":"Canon 150-600mm (f/5-6.3) lens","description":"Capture the power and beauty of wildlife, birds, travel destinations, and exciting sports action close-ups with this high-performance 150-600mm long-range zoom. This lens enables you to shoot crisp images of fast-moving, distant subjects handheld, while proprietary Tamron optical technology","price":2265,"title_tags":"Rent Canon 150-600mm at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Tamron15-600mm.jpg","vendor":"AST","category":"Cameras","slug":"canon-150-600mm-(f/5-6.3)-lens"},{"name":"Windows Laptop i3","description":"Get your hands on the latest versions of windows laptop with Core i3, in various screen sizes. For individuals, freelancers and corporate. Available in brands like DELL/HP/Lenovo.","price":8405,"title_tags":"Rent Laptop at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Laptop.jpg","vendor":"GBR","category":"Electronics","slug":"windows-laptop-i3"},{"name":"Zoom H4n Portable Recorder","description":"The H4n Recorder has long been a favorite of audio and video aficionados everywhere. It is a great audio companion for everything from live concert recording to location videography to music-making.... Capture the crystal clear sound of a pindrop.","price":9238,"title_tags":"Rent Zoom H4n Portable Recorder at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/ZoomH4n.jpg","vendor":"GBR","category":"Party","slug":"zoom-h4n-portable-recorder"},{"name":"Canon 70-200 f2.8 lens","description":"Top of the notch and most celebrated Canon 70-200mm Telephoto Zoom lens is designed for the challenging environments typical of rigorous professional use.","price":3133,"title_tags":"Rent Canon 70-200 f2.8 lens at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Canon_70_200mm_f28.jpg","vendor":"AST","category":"Cameras","slug":"canon-70-200-f2.8-lens"},{"name":"Canon EOS 6D","description":"Canon EOS 6D is one of the lightest full-frame DSLR. It stands closest and is up in the line next to Canon 5D Mark III. If you're in the market for a full-frame DSLR for ultimate technical quality and super-fast autofocus for action this is the camera for you.","price":9062,"title_tags":"Rent Canon EOS 6D at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Canon6D.jpg","vendor":"GBR","category":"Party","slug":"canon-eos-6d"},{"name":"Board Games Set","description":"Gather your mates and engage in some friendly competition with board games listed on Mutterfly.","price":5204,"title_tags":"Rent Board Games at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/boardgames.jpg","vendor":"GBR","category":"Electronics","slug":"board-games-set"},{"name":"Sigma 10-20mm f3. 5","description":"The Sigma 10-20mm F3.5 wide angle lens is perfect for low light photography. It is a great choice for indoor shooting as well as creative portraiture,Travel, Landscape, Wedding & Events, Nature & Wildlife, Specialty.","price":737,"title_tags":"Rent Sigma 10-20mm f3. 5 at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Sigma_1020mm_f35.jpg","vendor":"RPC","category":"Cameras","slug":"sigma-10-20mm-f3.-5"},{"name":"Canon EOS 60D","description":"Canon 60D is a great camera for photography enthusiasts with its amazing features and creative filters. A mid way ranges camera between Canon EOS 550D and Canon EOS 7D.","price":1183,"title_tags":"Rent Canon EOS 60D at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Canon_60D.jpg","vendor":"AST","category":"Party","slug":"canon-eos-60d"},{"name":"Nikon D3200","description":"Nikon D3200 is a compact size amazing entry level DSLR in the Nikon range. It offers outstanding photos and Full HD - movies. Great for event photography and videos.","price":3194,"title_tags":"Rent Nikon D3200 at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Nikon_D3200.jpg","vendor":"GBR","category":"Electronics","slug":"nikon-d3200"},{"name":"Tamron 70-300mm (f 4.0 - 5.6) Nikon Lens","description":"The Tamron 75-300mm telephoto zoom lens is ideal for a wide range of applications. Great for shooting wildlife or sporting events, the lens gives a beautiful background blur-a must if you want your shot to look crisp and larger than life.","price":5560,"title_tags":"Rent 70-300mm Tamaron Lens - Nikon at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/75-300mm_TamronLens_Nikon.jpg","vendor":"GBR","category":"Electronics","slug":"tamron-70-300mm-(f-4.0---5.6)-nikon-lens"},{"name":"Sleeping Bag","description":"Nothing beats the feeling of zipping yourself in a sleeping bag and gazing at the stars. Have the greatest night under the stars or in cozy tents for your best adventures. Select your dates and choose the sleeping bag you like on Mutterfly.","price":4436,"title_tags":"Rent Sleeping Bag at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Sleeping_Bag.jpg","vendor":"RPC","category":"Electronics","slug":"sleeping-bag"},{"name":"Digitek 8 Hi-Speed Flash","description":"An indispensable accessory for many photographers, used as a highly effective creative tool to establish an aesthetic for the perfect shots. The flash provided would be Canon or Digitek.","price":2340,"title_tags":"Rent Camera Flash at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Canon430FxII.jpg","vendor":"AST","category":"Party","slug":"digitek-8-hi-speed-flash"},{"name":"Zhiyun Crane 2 Gimbal","description":"The 3 Axis Handheld Gimbal helps to shoot steady and smooth streams easily in all angles. It provides 360 degrees panoramic shots along 3 axes. Ideal for DSLR cameras, Go Pro, Mobile Phones.","price":9651,"title_tags":"Rent 3 Axis Handheld Gimbal at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/3AxisGimbal.jpg","vendor":"RPC","category":"Electronics","slug":"zhiyun-crane-2-gimbal"},{"name":"Bungee Trampoline","description":"See your little one fly up in the air with the Bungee Trampoline experience.\nThis set adds an element of amusement and fun to any birthday party or themed event for kids. Select your dates and book now!\nFor Kids age group 5-15 yrs","price":3341,"title_tags":"Rent Bungee Trampoline | Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Bungee_Trampoline.jpg","vendor":"RPC","category":"Party","slug":"bungee-trampoline"},{"name":"Inflatable Bouncy House","description":"Enjoy hours of active-fun with Fun city. This bouncy set-up brings to you a house full of playtime and amusement for your little ones! The fun city is a great addition to birthday parties, theme events, and picnics.\nFor Kids age group 5-13 yrs","price":9600,"title_tags":"Rent Inflatable Bouncy House | Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Inflatable_Bouncy_House.jpg","vendor":"GBR","category":"Electronics","slug":"inflatable-bouncy-house"},{"name":"Sony A3500","description":"Sony Alpha A3500 is a mirrorless camera. It lets you shoot in dim lighting, you can shoot beautiful photos with natural tonal gradations and low noise - without using a flash.","price":7079,"title_tags":"Rent Sony A3500 at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Sony_A3500.jpeg","vendor":"GBR","category":"Cameras","slug":"sony-a3500"},{"name":"Trekking Pole","description":"Heading for a steep climb or leisure hike? A trekking pole will give you the right balance and save you a ton of energy on the way.","price":4072,"title_tags":"Rent Trekking Pole at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/TrekkingPole.jpg","vendor":"RPC","category":"Party","slug":"trekking-pole"},{"name":"Party Speakers","description":"Looking for some great speakers for your House party? Enter your dates and check out some sleek and stylish options. Let the music play! Use lift up your event, house party, bachelorette, birthday parties etc.","price":5699,"title_tags":"Rent Party Speakers at low prices - Mutterfly.in","image":"https://s3-us-west-2.amazonaws.com/elasticbeanstalk-us-west-2-492482793628/flamingo/products/party+speakers+new-min.jpg","vendor":"AST","category":"Cameras","slug":"party-speakers"},{"name":"Microphone","description":"Get a wide range from Sennheiser, Shure and Ahuja for live events, studio sound recording, radio television broadcasting etc.","price":3543,"title_tags":"Rent Microphone at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Microphone.jpg","vendor":"GBR","category":"Electronics","slug":"microphone"},{"name":"Rode Mic","description":"The Rode Mic is a professional grade microphone designed to use with general video cameras and personal audio recorders. The most highly used Mic by all your favourite YouTubers.","price":884,"title_tags":"Rent Rode Mic at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/RODE.jpg","vendor":"RPC","category":"Electronics","slug":"rode-mic"},{"name":"Canon 10-18mm STM Lens","description":"The Canon EF-S 10-18mm STM lens combines optical excellence with cutting-edge performance, providing an ultra-wide angle of view in a compact, portable package. An ideal lens for everyday photography, travel, stills and video recording.","price":5143,"title_tags":"Rent Canon 10 -18mm STM Lens at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Canon10-18mm.jpg","vendor":"AST","category":"Electronics","slug":"canon-10-18mm-stm-lens"},{"name":"Boom Mic","description":"A boom mic is any microphone that is at the end of a long, extended pole, also known as a boom pole. Mainly used for free directional recording. \nIt is highly used by film and television production.","price":7236,"title_tags":"Rent Boom Mic at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/BoomMic.png","vendor":"AST","category":"Electronics","slug":"boom-mic"},{"name":"Glidecam HD 2000","description":"The lightweight hand-held Camera Stabilizers will transform your hard to watch, shaky camera footage into smooth, professional looking shots. Get those skilled and polished tailormade shots for your videos with the glidecam.","price":2664,"title_tags":"Rent Glidecam Stablizer at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Glidecam.jpg","vendor":"AST","category":"Party","slug":"glidecam-hd-2000"},{"name":"Ronin Freefly Rig-Canon","description":"Get the perfect stabilized panning shots and running shots as well as overhead flying shots and still shots without any hassle with the Ronin/Freefly Rig. Give a professional finish to your videos with the Rig.","price":690,"title_tags":"Rent Ronin/Freefly Rig - Canon at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/RoninFreeflyCanon.jpg","vendor":"RPC","category":"Party","slug":"ronin-freefly-rig-canon"},{"name":"Canon Lens 18-200mm","description":"Compact, light weight and a wide magnification range - this standard zoom lens features a wide focal length range from normal to telephoto equivalent.The new wide zoom ratio EF-S lens delivers excellent high-speed performance.","price":1695,"title_tags":"Rent 18 - 200mm Canon Lens at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Canon18_200mm-Lens.jpg","vendor":"GBR","category":"Electronics","slug":"canon-lens-18-200mm"},{"name":"Sony A7S II","description":"Some of your favourite movies have been shot with this amazing camera. A storyteller's most important instrument for making a film is the camera. A must have for a budding filmmaker. ","price":8244,"title_tags":"Rent Sony A7S II at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Sony_A7.jpg","vendor":"AST","category":"Party","slug":"sony-a7s-ii"},{"name":"Walky Talky","description":"Best suited for high profile functions and events like college fest, corporate events, Conferences etc. Walky Talky available in brands like Motorola, Midland, Cobra.","price":1520,"title_tags":"Rent Walky Talky at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Walky_Talky.jpg","vendor":"RPC","category":"Party","slug":"walky-talky"},{"name":"Twister","description":"A fun game that challenges you to put your hands and feet at different places on the mat without falling over.\nBe the last player standing to win. Select your dates and rent Twister on Mutterfly.","price":3687,"title_tags":"Rent Twister at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/twister.jpg","vendor":"AST","category":"Electronics","slug":"twister"},{"name":"Rhino Slider 24\"/42\"","description":"Camera Slider helps you mobilize any movie camera, video camera, digital camera or other piece of equipment. \nAs you slide the camera across the slider and take pictures each picture is seeing the subject at a different angle. It provides shake free stability Support to Cameras while shooting.","price":7096,"title_tags":"Rent Camera Slider at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Camera_Slider_Mannual.jpg","vendor":"AST","category":"Electronics","slug":"rhino-slider-24\"/42\""},{"name":"Poker Set","description":"Everything you need for a friendly game of poker comes in one great package.Have the best Poker Nights with your gang of friends, ideal for a diwali night or a causal weekend get togther. Select your dates and rent from the options available on Mutterfly.","price":9992,"title_tags":"Rent Poker Set at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Poker_Set.jpg","vendor":"GBR","category":"Party","slug":"poker-set"},{"name":"Monopod","description":"The monopod allows a still camera to be held steadier, allowing the photographer to take sharp pictures at slower shutter speeds, and/or with longer focal length lenses.","price":667,"title_tags":"Rent Monopod at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Monopod.jpg","vendor":"AST","category":"Cameras","slug":"monopod"},{"name":"DJI Mavic Air Camera Drone","description":"Camera drones are all the rage right now among photography enthusiasts and filmmakers. Get the most scenic shots with the drone and amp up your shots.\n\nThere are different level of drone photography enthusiasts and we have something for each one.\n\nNote: Flying of the drone is permitted only in specific areas. Please check before flying the same. Mutterfly will not be liable for any action taken against you for the use in restricted areas.\nIn the case of confiscation of the drone, you will reimburse the entire charges of the drone ( MRP ) to Mutterfly Technologies Pvt. Ltd.","price":5357,"title_tags":"Rent DJI Phantom Mavic Air Camera Drone at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/DJI_Mavic_Air_Camera_Drone.jpg","vendor":"AST","category":"Electronics","slug":"dji-mavic-air-camera-drone"},{"name":"3 Man Tent","description":"Sometimes all you need is a clear sky and a tent underneath. Have the best camping nights. For all the little and great adventures. Select your dates and rent a cosy tent on Mutterfly.","price":954,"title_tags":"Rent 3 Man Tent at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/3_Man_Tent.jpg","vendor":"RPC","category":"Party","slug":"3-man-tent"},{"name":"6 Man Tent","description":"Sometimes all you need is a clear sky and a tent underneath. Have the best camping nights. For all the little and great adventures. Select your dates and rent a cosy tent on Mutterfly.","price":5694,"title_tags":"Rent 6 Man Tent at low prices - Mutterfly.in","image":"https://s3-us-west-2.amazonaws.com/elasticbeanstalk-us-west-2-492482793628/flamingo/products/6+man+tent+prod.+image-min.jpg","vendor":"RPC","category":"Party","slug":"6-man-tent"},{"name":"Fujifilm Instax wide Polaroid Camera","description":"Fuel your nostalgia. For the love of old school and instant films get your hands on the ever classic Polaroid cameras! \njust click and hold the picture in your hand in no time! Get the best memories captured for your birthdays, reunions, bachelorette, corporate events, etc.","price":3299,"title_tags":"Rent Fujifilm Instax wide Polaroid Camera at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Fujifilm_Instax_wide_Polaroid_Camera.jpg","vendor":"GBR","category":"Electronics","slug":"fujifilm-instax-wide-polaroid-camera"},{"name":"Trekking Backpack-70 L","description":"If you are heading for the outdoors, a good trekking backpack will be your lifeline. Enter your dates and choose from a range of options on Mutterfly. The best combination and a must have with your trekking gear. Climb the highest mountains with your trekking backpack.","price":7408,"title_tags":"Rent Trekking Backpack 70 L at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Trekking_Backpack_70_L.jpg","vendor":"AST","category":"Party","slug":"trekking-backpack-70-l"},{"name":"50 inch TV","description":"LED flatcreen TV with amazing visual and sound outputs, great for gaming events, movie screenings, sports match screenings etc. TVs provided would be Micromax /Viu/ Panasonic.","price":8076,"title_tags":"Rent 50\" TV at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/50_TV.jpg","vendor":"RPC","category":"Electronics","slug":"50-inch-tv"},{"name":"DJI Mavic Pro Camera Drone","description":"Camera drones are all the rage right now among photography enthusiasts and filmmakers. Get the most scenic shots with the drone and amp up your shots.\n\nThere are different level of drone photography enthusiasts and we have something for each one.\n\nNote: Flying of the drone is permitted only in specific areas. Please check before flying the same. Mutterfly will not be liable for any action taken against you for the use in restricted areas.\nIn the case of confiscation of the drone, you will reimburse the entire charges of the drone ( MRP ) to Mutterfly Technologies Pvt. Ltd.","price":7856,"title_tags":"Rent DJI Phantom Mavic Pro Camera Drone at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/DJI_Phantom_Mavic_Pro_Camera_Drone.jpg","vendor":"AST","category":"Cameras","slug":"dji-mavic-pro-camera-drone"},{"name":"Windows Laptop i5","description":"Get your hands on the latest versions of windows laptop with Core i5, in various screen sizes. For individuals, freelancers and corporate. Available in brands like DELL/HP/Lenovo.","price":5887,"title_tags":"Rent Windows Laptop i5 at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Windows_Laptop_i5.jpg","vendor":"RPC","category":"Cameras","slug":"windows-laptop-i5"},{"name":"Rhino Motorised Slider","description":"Camera Slider helps you mobilize any movie camera, video camera, digital camera or other piece of equipment. \nAs you slide the camera across the slider and take pictures each picture is seeing the subject at a different angle. It provides shake free stability Support to Cameras while shooting.","price":8495,"title_tags":"Rent Camera Slider - Motor at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Camera_Slider_Motor.jpg","vendor":"AST","category":"Electronics","slug":"rhino-motorised-slider"},{"name":"GoPro Hero 7 Black","description":"Rent the best action camera, GoPro, along with a variety of mounts. Book on Mutterfly and get it delivered to your doorstep.","price":1609,"title_tags":"Rent GoPro in Mumbai | Bangalore | Starting at Rs 600","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/GoPro+hero+7+Black.jpg","vendor":"RPC","category":"Cameras","slug":"gopro-hero-7-black"},{"name":"Sumo Wrestling Suits Kit","description":"One of the most entertaining game, Sumo Suits, is a fun sport where one wrestler tries to force the other outside of the ring (mat). The wrestlers can push, pull or wrestle the other sumo opponent to win the round. A match is played in best of 3 rounds.\n\nPut on the suit and get ready for the (funniest) match of your life. Book your Sumo Experience today on Mutterfly.","price":4082,"title_tags":"Sumo Suit Rentals - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Sumo_Suit.jpg","vendor":"AST","category":"Electronics","slug":"sumo-wrestling-suits-kit"},{"name":"HTC Vive VR","description":"Experience the world in a whole new manner with the Virtual Reality headsets.\nVR headsets are widely used for Video Gaming, Films and entertainment.","price":8241,"title_tags":"Rent VR Set at low prices - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/HTC_Vive.jpg","vendor":"GBR","category":"Electronics","slug":"htc-vive-vr"},{"name":"Mechanical Bull RIde","description":"Get ready for the ride of your life. The mechanical bull makes a great addition to party / corporate events and is sure to make everyone laugh. The bull is accompanied by a surrounding safety foam and is completely safe to use by all age groups. The mechanical bull comes along with an operator to manage the speed and direction. The setup requires a space of 12 ft x 12 ft and usually takes 30 minutes for the full setup. 1-day duration includes 6 hours of playtime. In case you require any additions feel free to reach us and we will be glad to help you out.\n\n\nSo hop on and ride the bull until you lose your balance.","price":6534,"title_tags":"Rent Mechanical bull ride - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/mechanical_bull_ride.jpg","vendor":"AST","category":"Electronics","slug":"mechanical-bull-ride"},{"name":"PS4 Controller","description":"This includes 1 Dual Shock Playstation 4 controller compatible with PlayStation 4 gaming console.","price":7314,"title_tags":"Rent PS4 controllers - Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/PS4_Controller.jpg","vendor":"RPC","category":"Cameras","slug":"ps4-controller"},{"name":"Inflatable Dart Game","description":"Inflatable darts is a hilarious sport and makes a great addition to parties and corporate. Scored in the same manner as traditional darts, but utilising specially designed \"foot darts\" which stick to the Velcro-covered dartboard, foot darts are fantastic fun for children and adults of all ages.\n\nInflatable dart is sure to be a big hit as no one will be able to resist the temptation when they see a giant inflatable dart. So book on Mutterfly and get ready to have a blast.\n\nThe game is only available for 4 - 5 Hours Duration.","price":4724,"title_tags":"Rent Inflatable Dart Board in Mumbai-Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Inflatable_Dart_Game.jpg","vendor":"AST","category":"Cameras","slug":"inflatable-dart-game"},{"name":"Big Ball Game","description":"The big ball game is a great way to have fun and test physical strength. Participants can test their jumping ability by jumping on the Big Red Balls! Run and jump across these balls as best you can to make it to the other side!\n\nThe game is only available for 4 - 5 Hours Duration.","price":5081,"title_tags":"Rent Inflatable Big Ball game in Mumbai-Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Big_Ball_Game.jpg","vendor":"AST","category":"Electronics","slug":"big-ball-game"},{"name":"Mini Toy Train","description":"The mini electric train one of the best ways to celebrate your kid’s party. Accompanied with a professional attendant, the electric mini train is sure to make the kids smile and have a party they will always remember.\n\nThe game is only available for 4 - 5 Hours Duration.","price":2682,"title_tags":"Rent Mini Toy Train in Mumbai-Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Mini_Toy_Train.jpg","vendor":"RPC","category":"Party","slug":"mini-toy-train"},{"name":"Balloon Rifle Shooting Game","description":"Convert your party into a carnival with Balloon rifle shooting.  Balloon shooting is an entertaining event that can be organised at birthday parties and in many other functions too. It is a good entertainment and time pass for the entire guests present at your party. You just have to aim and hit the balloons with a bullet. Pop a certain number of balloons to win the prize.\n\nThe game is only available for 4 - 5 Hours Duration.","price":9755,"title_tags":"Rent Balloon Rifle Shooting Game in Mumbai-Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Balloon_Rifle_Shooting_Game.jpg","vendor":"AST","category":"Electronics","slug":"balloon-rifle-shooting-game"},{"name":"Inflatable Bowling Game","description":"Get ready for hours of endless fun with Giant Bowling. Similar to traditional bowling, players need to drop all the pins to get a strike - just that in this game they can use their legs to kick the ball. This games is sure to be a hit for your next party and can be played both indoor and outdoors by all age groups.\n\nThe game is only available for 4 - 5 Hours Duration.","price":859,"title_tags":"Rent Inflatable Bowling in Mumbai-Mutterfly.in","image":"https://s3.ap-south-1.amazonaws.com/mutterfly/products/Inflatable_Bowling_Game.jpg","vendor":"GBR","category":"Electronics","slug":"inflatable-bowling-game"}]